//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 13.  Напишите функцию, которая вернет массив с группированными элементами исходных массивов.
//      Логика группировки:
//      первая группа состоит из всех первых элементов исходных массивов,
//      вторая группа - из вторых элементов и т.д.
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*function group(...inputArray){
    return inputArray.reduce((acc, value,index)=> {
        acc[0][index] = value [index]
    }, [[],[]])

    // slice ==>  возвращает новый массив, содержащий копию части исходного массива.
    // filter ==> заполняет все элементы массива от начального до конечного индексов одним значением.
}*/

function group(){

}



console.log(group(['a', 'b'], [1, 2], [true, false])); // [['a', 1, true], ['b', 2, false]]