//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 13.  Напишите функцию, которая вернет массив с группированными элементами исходных массивов.
//      Логика группировки:
//      первая группа состоит из всех первых элементов исходных массивов,
//      вторая группа - из вторых элементов и т.д.
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////

const group = (...allArrays) => {
    return [...allArrays].reduce((acc, curr) => {
        return [[ ...(acc[0] || []) , curr[0]], [...(acc[1] || []), curr[1]]]
    }, [])
};

console.log(group(['a', 'b'], [1, 2], [true, false])); // [['a', 1, true], ['b', 2, false]]